const str = `<p><joe-dplayer src="/upload/2023/07/%E7%99%BD%E9%86%8B%E7%9A%84%E5%A6%99%E7%94%A8.mp4"></joe-dplyer></p>
<p>白醋的威力有多强大？最后一个惊掉你下巴。<br />
一、白醋加可乐喷在玻璃上，玻璃干净又明亮。<br />
二、白醋加花露水喷在马桶黄渍处，轻松去除黄渍和异味。<br />
三、白醋加洗洁精，去油能力超级强。<br />
四、白醋加白酒擦拭冰箱表面，去污效果明显。<br />
五、白醋加小苏打喷在瓷砖缝隙，污渍通通擦掉。<br />
六、锅底烧糊怎么办？加入牙膏、小苏打、白醋、雪碧，加入清水搅拌均匀，将锅放入水池浸泡几分钟，然后轻轻刷洗，就可以洗干净了。<br />
七、家里燃气灶用久了，会有一层厚厚的油污，很难清理。挤上洗洁精，撒上小苏打，最后倒上白醋，静止十分钟，抹布一擦，立马干干净净，焕然一新。<br />
关注我，学习更多实用妙招。</p>
`




// 使用正则 替换 joe-dplayer 为 video标签
  const reg = /<joe-dplayer src="(.*)"><\/joe-dplyer>/g
  const str2 = str.replace(reg, '<video src="$1"></video>')
console.log(str2)